eisup_2019_docmng_integration/src/InformationRegisters/СоответствиеПодразделенийИПодразделенийОрганизаций/СоответствиеПодразделенийИПодразделенийОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствиеПодразделенийИПодразделенийОрганизаций</name>
  <comment>Соответствие подразделений и подразделений организаций</comment>
  <dimensions>
    <name>Подразделение</name>
    <comment>Подразделение</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <comment>Подразделение организации</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИсторияИзмененияОбособленныхПодразделенийОС/абс_ИсторияИзмененияОбособленныхПодразделенийОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИсторияИзмененияОбособленныхПодразделенийОС</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.абс_ОбособленныеПодразделения</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Documents/ПеремещениеОС/ПеремещениеОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеОС</name>
  <comment>(Общ)</comment>
  <basedOn>Document.ИнвентаризацияОС</basedOn>
  <registerRecords>InformationRegister.СобытияОСОрганизаций</registerRecords>
  <registerRecords>InformationRegister.СобытияОС</registerRecords>
  <registerRecords>InformationRegister.МестоЭксплуатацииОСПоСооружению</registerRecords>
  <registerRecords>InformationRegister.МестонахождениеОСБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.МестонахождениеОС</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛОрганизации</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВБухгалтерскомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВУправленческомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеРегл</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Основание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОтпускРазрешил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Обособленное</name>
    <type>
      <types>CatalogRef.абс_ОбособленныеПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОС</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ОсновноеСредство</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоЭксплуатацииПоСооружению</name>
      <type>
        <types>CatalogRef.МестаЭксплуатацииПоСооружению</types>
      </type>
    </attributes>
    <attributes>
      <name>ФункциональнаяПринадлежность</name>
      <type>
        <types>CatalogRef.КлассификаторСетейМСС</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/CommonModules/абс_ВнеоборотныеАктивыВызовСервера/Module.bsl
Процедура ВыполнитьНачислениеАмортизацииОС(Ссылка, Отказ) Экспорт
	
	абс_ВнеоборотныеАктивы.ВыполнитьНачислениеАмортизацииОС(Ссылка, Отказ);
	
КонецПроцедуры

Функция ПолучитьПодразделениеОрганизации(Подразделение, ТекущееПодразделениеОрганизации, СпособОтражения, Организация) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Подразделение) Тогда 
		Возврат ТекущееПодразделениеОрганизации;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда 
		Возврат ТекущееПодразделениеОрганизации;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СпособОтражения) Тогда 	
		Если СпособОтражения.Организация = Организация Тогда 
			Возврат ТекущееПодразделениеОрганизации;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации
	                      |ИЗ
	                      |	РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций
	                      |ГДЕ
	                      |	СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение = &Подразделение
	                      |	И СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации <> &ПустоеПодразделениеОрганизации
	                      |	И СоответствиеПодразделенийИПодразделенийОрганизаций.Организация = &Организация");
				   
	Запрос.УстановитьПараметр("Подразделение",	Подразделение);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("ПустоеПодразделениеОрганизации",Справочники.ПодразделенияОрганизаций.ПустаяСсылка());

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ПодразделениеОрганизации;
	КонецЕсли;
	
	Возврат ТекущееПодразделениеОрганизации; 
	
КонецФункции

Процедура ЗаполнитьОбособленноеПодразделениеОС(СтруктураШапкиДокумента) Экспорт
	
	Если СтруктураШапкиДокумента.Свойство("абс_Обособленное") Тогда 
		ОбособленноеПодразделение = СтруктураШапкиДокумента.абс_Обособленное;
	ИначеЕсли СтруктураШапкиДокумента.Свойство("абс_ОбособленноеПодразделение") Тогда
		ОбособленноеПодразделение = СтруктураШапкиДокумента.абс_ОбособленноеПодразделение;
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТаблицаОС.ОсновноеСредство
	                      |ИЗ
	                      |	Документ.ПеремещениеОС.ОС КАК ТаблицаОС
	                      |ГДЕ
	                      |	ТаблицаОС.Ссылка = &Ссылка
	                      |	И ТаблицаОС.ОсновноеСредство.абс_ОбособленноеПодразделение <> &ОбособленноеПодразделение");
						  
	Запрос.УстановитьПараметр("Ссылка", 					СтруктураШапкиДокумента.Ссылка);						  
	Запрос.УстановитьПараметр("ОбособленноеПодразделение", 	ОбособленноеПодразделение);						  
	
	Если СтруктураШапкиДокумента.ВидДокумента = "ПринятиеКУчетуОС" Тогда  
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПеремещениеОС.ОС", "ПринятиеКУчетуОС.ОсновныеСредства");
	// Гущина T#7763513  2017.02.07 +++
	ИначеЕсли СтруктураШапкиДокумента.ВидДокумента = "абс_РазукрупнениеОС" Тогда  
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПеремещениеОС.ОС", "абс_РазукрупнениеОС.ОС");
	ИначеЕсли СтруктураШапкиДокумента.ВидДокумента = "ВводНачальныхОстатковОС" Тогда  
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПеремещениеОС.ОС", "ВводНачальныхОстатковОС.ОС");
	//Гущина  2017.02.07 ---
	КонецЕсли;
	
	ВыборкаОС = Запрос.Выполнить().Выбрать();
	Пока ВыборкаОС.Следующий() Цикл 
		
		ОбъектОС = ВыборкаОС.ОсновноеСредство.ПолучитьОбъект();
		//ОбъектОС.абс_ОбособленноеПодразделение = СтруктураШапкиДокумента.абс_Обособленное;
		ОбъектОС.абс_ОбособленноеПодразделение = ОбособленноеПодразделение;
		ОбъектОС.ОбменДанными.Загрузка = Истина;
		
		Попытка 
			ОбъектОС.Записать();
			
			// Гущина T#7763513  2017.01.11 +++   переношу из модуля объекта из ПриЗаписи  справочника Осн.средств. добавила &ДатаДокумента и период
			
			Запрос = Новый Запрос("ВЫБРАТЬ РАзрешенные
			|	абс_ИсторияИзмененияОбособленныхПодразделенийОС.ОбособленноеПодразделение,
			|	абс_ИсторияИзмененияОбособленныхПодразделенийОС.Период
			|ИЗ
			|	РегистрСведений.абс_ИсторияИзмененияОбособленныхПодразделенийОС.СрезПоследних(&ДатаДокумента
			|			,
			|			ОсновноеСредство = &ОС) КАК абс_ИсторияИзмененияОбособленныхПодразделенийОС");
			Запрос.УстановитьПараметр("ОС", ОбъектОС.ссылка);
			Запрос.УстановитьПараметр("ДатаДокумента", СтруктураШапкиДокумента.Ссылка.Дата);
			
			Выборка = Запрос.Выполнить().Выбрать();
			//Если Выборка.Следующий() и Выборка.ОбособленноеПодразделение <> СтруктураШапкиДокумента.абс_Обособленное и  Выборка.Период <> СтруктураШапкиДокумента.Ссылка.Дата 
			Если Выборка.Следующий() и Выборка.ОбособленноеПодразделение <> ОбособленноеПодразделение и  Выборка.Период <> СтруктураШапкиДокумента.Ссылка.Дата 
				ИЛИ Выборка.Количество() = 0 тогда
				НаборЗаписей = РегистрыСведений.абс_ИсторияИзмененияОбособленныхПодразделенийОС.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ОсновноеСредство.Установить(ОбъектОС.ссылка);
				
				НаборЗаписей.Прочитать();
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = СтруктураШапкиДокумента.Ссылка.Дата; //было ТекущаяДата();
				НоваяЗапись.ОбособленноеПодразделение = ОбособленноеПодразделение;//СтруктураШапкиДокумента.абс_Обособленное;
				НоваяЗапись.ОсновноеСредство = ОбъектОС.ссылка;
				НаборЗаписей.Записать();
				
			//ИначеЕсли Выборка.ОбособленноеПодразделение <> СтруктураШапкиДокумента.абс_Обособленное и  Выборка.Период = СтруктураШапкиДокумента.Ссылка.Дата тогда	
			ИначеЕсли Выборка.ОбособленноеПодразделение <> ОбособленноеПодразделение и  Выборка.Период = СтруктураШапкиДокумента.Ссылка.Дата тогда	
				НаборЗаписей = РегистрыСведений.абс_ИсторияИзмененияОбособленныхПодразделенийОС.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ОсновноеСредство.Установить(ОбъектОС.ссылка);
				НаборЗаписей.Отбор.Период.Установить(СтруктураШапкиДокумента.Ссылка.Дата);
				НаборЗаписей.Прочитать();
				Для Каждого СтрЗаписи из НаборЗаписей цикл
					СтрЗаписи.ОбособленноеПодразделение = ОбособленноеПодразделение;//СтруктураШапкиДокумента.абс_Обособленное;
				КонецЦикла;	
				НаборЗаписей.Записать();
			КонецЕсли;
			// Гущина T#7763513  2017.01.11 ---
		Исключение
			Сообщить("Обособленное подразделение в карточке ОС не изменено: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
		
КонецПроцедуры
